Repository: quochoang228/quantum-calcu
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Quantum Calculator
vi: Máy tính Lượng tử

# homeTagline
source: Explore quantum computing via visual simulation, canonical algorithms, and distributed quantum networking.
vi: Khám phá điện toán lượng tử qua mô phỏng trực quan, các thuật toán kinh điển và mạng lượng tử phân tán.

# cardCircuitSimulator
source: Circuit Simulator
vi: Mô phỏng Mạch

# cardCircuitSimulatorSubtitle
source: Build, run & measure
vi: Tạo, chạy & đo

# cardAlgorithms
source: Algorithms
vi: Thuật toán

# cardBasics
source: Basics
vi: Cơ bản

# cardBasicsSubtitle
source: Superposition & entanglement
vi: Chồng chập & rối lượng tử

# cardLearning
source: Learning Mode
vi: Chế độ Học

# cardLearningSubtitle
source: Lessons & Quizzes
vi: Bài học & Trắc nghiệm

# cardNetwork
source: Quantum Network
vi: Mạng Lượng tử

# cardNetworkSubtitle
source: Distributed & teleportation
vi: Phân tán & dịch chuyển

# cardAdvanced
source: Advanced
vi: Nâng cao

# cardAdvancedSubtitle
source: Optimization • QFT • QEC
vi: Tối ưu • QFT • Sửa lỗi

# tabCircuitOptimization
source: Circuit Optimization
vi: Tối ưu Mạch

# tabEntanglement
source: Entanglement
vi: Rối lượng tử

# tabErrorCorrection
source: Error Correction
vi: Sửa lỗi

# tabShorCode
source: Shor Code
vi: Mã Shor

# tabTeleportation
source: Teleportation
vi: Dịch chuyển

# tabRng
source: Quantum RNG
vi: Bộ sinh ngẫu nhiên

# tabSynthesis
source: Circuit Synthesis
vi: Tổng hợp Mạch
